#include "ft_printf.h"
#include <stdio.h>

int main(int argc, char **argv)
{

/*
    printf("%015.8f\n", 0.);
    ft_printf("%015.8f\n\n\n", 0.); //неправильное количество нулей в последнем столбце


    printf("%f|%-f|%+f|% f|%#f|%0f\n", -0., -0., -0., -0., -0., -0.);
    ft_printf("%f|%-f|%+f|% f|%#f|%0f\n\n\n", -0., -0., -0., -0., -0., -0.); //неправильная обработка символов + - и пробел перед флагом f

    printf("%5f|%-5f|%+5f|% 5f|%#5f|%05f\n", -0., -0., -0., -0., -0., -0.);
    ft_printf("%5f|%-5f|%+5f|% 5f|%#5f|%05f\n\n\n", -0., -0., -0., -0., -0., -0.); //тоже самое. должно игнорироваться все знаки после доллара и перед флагом, как я понимаю

    printf("%05f\n", INFINITY);
    ft_printf("%05f\n\n\n", INFINITY); //странные нули перед началом inf




*/



    //ft_printf("%15.1f|%15.2f|%15.5f|%15.12f", 999.99999, 999.99999, 999.99999, 999.99999);
    //printf("%15.8f|%-15.8f|%+15.8f|% 15.8f|%#15.8f|%014.8f\n\n", DBL_MIN, DBL_MIN, DBL_MIN, DBL_MIN, DBL_MIN, DBL_MIN);
    ft_printf("%.f|%.f|%.f|%.f|%.f\n\n", 44.5, 44.4, 44.6, 44.50001, 44.5 + 1e-52);
    printf("%.f|%.f|%.f|%.f|%.f", 44.5, 44.4, 44.6, 44.50001, 44.5 + 1e-52);
    //ft_printf("%15.1f", 456.677);
    //printf("%f|%-f|%+f|% f|%#f|%0f", 0., 0., 0., 0., 0., 0.);
    return(0);
}

//"%#.5hho", ULLONG_MAX - 00037
//"%#.5o", 0U - 00000
//"%#o", UINT_MAX - 037777777777
//"%#o", 0U - 0
